In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
male_data=pd.read_csv(r"C:\Users\PIYUSH\Desktop\gender_male\m_names.csv")

In [3]:
male_data.head()

              name gender    race
0          barjraj      m  indian
1     ramdin verma      m  indian
2  sharat chandran      m  indian
3  birender mandal      m  indian
4             amit      m  indian

In [4]:
male_data.shape

(14845, 3)

In [5]:
male_data.name.unique()

array(['barjraj', 'ramdin verma', 'sharat chandran', ...,
       'sanjya chhetri', 'buddha', 'govind prasad shahu'], dtype=object)

In [6]:
male_data.isnull().sum()

name      24
gender     0
race       0
dtype: int64

In [7]:
male_data.describe()

          name gender    race
count    14821  14845   14845
unique    8519      1       1
top     deepak      m  indian
freq       135  14845   14845

In [8]:
male_data.dropna(subset=["name"],inplace=True)

In [9]:
male_data.shape

(14821, 3)

In [10]:
male_data.isnull().sum()

name      0
gender    0
race      0
dtype: int64

In [11]:
male_data.drop_duplicates(subset=["name"],keep=False,inplace=True)

In [12]:
male_data.describe()

                           name gender    race
count                      7159   7159    7159
unique                     7159      1       1
top     randheer singh @ dheera      m  indian
freq                          1   7159    7159